export default function ImageModal() {
  //Компонент ImageModal повинен рендеритися всередині компоненту App та отримувати через пропси з App всі необхідні дані та функції.
  //Під час натискання на зображення галереї повинно відкриватися модальне вікно ImageModal з темним фоном, яке відображатиме зображення у великому форматі.
  //Модальне вікно має бути налаштовано таким чином, щоб воно закривалося при натисканні на клавішу ESC або при кліку за його межами.
  //Для реалізації функціональності модального вікна використовуй бібліотеку React Modal.
  return <div></div>;
}
