export default function ImageModal() {
  //Компонент ImageModal повинен рендеритися всередині компоненту App та отримувати через пропси з App всі необхідні дані та функції.
  //Під час натискання на зображення галереї повинно відкриватися модальне вікно ImageModal з темним фоном, яке відображатиме зображення у великому форматі.
  //Модальне вікно має бути налаштовано таким чином, щоб воно закривалося при натисканні на клавішу ESC або при кліку за його межами.
  //Для реалізації функціональності модального вікна використовуй бібліотеку React Modal.

  //Кожне зображення в масиві представлено об'єктом із великою кількістю інформації. В першу чергу тебе цікавлять посилання на різні за розміром версії зображення у властивості urls. Використовуй small версію для карток галереї, та regular версію для модального вікна.

  // Не обмежуйся завданням, використовуй дані із об'єктів, щоб відобразити більше цікавої інформації в модальному вікні. Наприклад, про автора зображення, кількість лайків, опис і т.д.
  //created_at
  //description
  //likes
  //tags
  //user.username ("автор")
  //links.download ("cкачати оригінал")
  return <div></div>;
}
