export default function LoadMoreBtn() {
  //Це нопка завантаження додаткових зображень
  //Компонент LoadMoreBtn рендерить кнопку із текстом "Load more". При натисканні на кнопку має завантажуватися наступна порція зображень і рендеритися разом із попередніми.
  //Кнопка має рендеритися лише тоді, коли є які - небудь завантажені зображення.
  //Якщо масив зображень порожній, кнопка не рендериться.Логіка повинна бути в App

  //<button onClick={smth} ...

  return (
    <div>
      <button>Load more</button>
    </div>
  );
}
